const aries = document.querySelector(".aries");
const taurus = document.querySelector(".taurus");
const gemini = document.querySelector(".gemini");
const cancer = document.querySelector(".cancer");
const leo = document.querySelector(".leo");
const virgo = document.querySelector(".virgo");
const libra = document.querySelector(".libra");
const scorpio = document.querySelector(".scorpio");
const sagittarius = document.querySelector(".sagittarius");
const capricorn = document.querySelector(".capricorn");
const aquarius = document.querySelector(".aquarius");
const pisces = document.querySelector(".pisces");



let arieshoro = `Не торопитесь. Этот универсальный совет становится особенно актуальным в начале 2022 года. Появляется много идей, желаний и планов, хочется добиться нескольких целей сразу, а на обстоятельства, которые не всегда складываются благоприятно, вы просто не обращаете внимания. Конечно, будет интересно, но придется много сил потратить зря. Поэтому лучше в первые дни года определиться с приоритетами, подумать о том, какими делами нужно заняться немедленно, а какие могут подождать.
До весны вам предстоит многому научиться, получить опыт, который позже поможет избежать ошибок, принять верные решения. Это касается и деловой сферы, и личных отношений. Появляется определенность там, где прежде были лишь намеки и догадки; это радует.
Весна – хорошее время для того, чтобы проявлять инициативу в делах, начинать работать над какими-то новыми проектами или учиться тому, что вас давно интересовало. Удается избежать стрессовых ситуаций, распределить свое время так, что его хватает на все. 
А вот лето преподносит один сюрприз за другим. Нельзя сказать, что они вас радуют, но скучать определенно не приходится. Вы стараетесь использовать любую возможность для того, чтобы научиться новому, а заодно показать всем вокруг, сколько всего вы уже умеете. Неудивительно, что в начале осени поступят какие-то интересные предложения о работе или сотрудничестве.
Заканчивается год спокойно. Последние его месяцы отлично подходят для того, чтобы без суеты завершить начатое, подвести итоги, подумать, что делать дальше. Рядом будет много людей, с которыми можно посоветоваться или просто поговорить по душам. Вы убедитесь, что у вас есть настоящие друзья, на которых можно положиться во всем.`

let taurushoro = `Интуиция подскажет, что январь – не лучшее время для того, чтобы браться за совершенно новые дела и что-то кардинально менять в жизни. Начало года отлично подходит для размышлений. Вы замечаете много того, на что прежде не обращали внимания, и делаете правильные выводы. Возможны удачные совпадения, стечение обстоятельств, которое натолкнет на интересные мысли.
С февраля по май продолжается благоприятный и важный период. Ваши суждения становятся более взвешенными и зрелыми, вы уже не поддаетесь на провокации, правильно ведете себя в непростых ситуациях. Становится проще принимать самостоятельные решения, вы гораздо меньше нуждаетесь в одобрении и поддержке окружающих. Именно этот период для многих Тельцов будет связан с важными решениями, которые определят их дальнейшую жизнь. Такие решения могут касаться и профессиональной деятельности, и личных отношений, и ваших собственных планов, о которых никто в ближайшее время не узнает.
Май и июнь порадуют удивительными событиями, удачными совпадениями. Судьба преподносит приятные сюрпризы, открывает одну возможность за другой. Не упустите свой шанс достичь успеха. Изобретательность и находчивость будут очень кстати. Благодаря этим качествам вы порой достигаете того, что другим кажется невозможным.
С июля по сентябрь вам предстоит многому научиться. Не стоит специально записываться на какие-то курсы: много полезных знаний вы получаете как будто между делом. В вашем окружении становится все больше людей, которые готовы делиться своим опытом и полезной информацией, которую вы вряд ли смогли бы получить из другого источника.
С октября начинается период, в течение которого вам нужно будет особенно внимательно следить за тем, как складываются отношения с окружающими. Они не всегда однозначны и просты, многое не говорится прямо, так что будьте готовы разбираться в намеках, искать ответы на непростые вопросы.
К концу года многое прояснится. У вас появится веская причина гордиться собой: станет совершенно ясно, что вы правильно поступили в непростой ситуации.`

let geminihoro = `Начинается год удачно. Звезды на вашей стороне, благодаря их поддержке вы отлично справлялись с делами, которые в прошлом году казались чрезвычайно сложными. Возможны необычные встречи, знакомства, открывающие массу новых возможностей. Не исключено, что именно в это время будут приняты решения, благодаря которым ваша карьера в ближайшее время пойдет в гору. 
Март и апрель будут беспокойными и интересными. Многие Близнецы в это время расстаются с иллюзиями, начинают смотреть на жизнь более реалистично. Какие-то неприятные моменты возможны, но вряд ли вы будете долго унывать и сокрушаться о несбывшемся. Новых возможностей открывается достаточно, вы стараетесь не упустить ни одной из них. Может заметно расшириться ваш круг общения. Люди, с которыми вы сначала будете обсуждать исключительно деловые темы, со временем станут друзьями.
С мая по июль продолжается период напряженной и плодотворной работы, полезных дел, с которыми никто не справится лучше вас. Вы многому учитесь, часто почти не замечая этого. Окружающие смотрят на вас с возрастающим удовольствием, все чаще прислушиваются к вашему мнению и обращаются за советами. Поскольку лидерские качества проявляются ярко, вам могут предложить руководящую работу.
Август приносит новые дела и заботы. Для многих Близнецов на первый план выходят семейные дела, и именно такой ситуация останется до конца года. Вы чувствуете, что нужны близким, и ради их комфорта и спокойствия можете отказаться от каких-то смелых планов, рискованных начинаний. Семейные отношения становятся более прочными. Вы понимаете, кто для вас по-настоящему важен и дорог. Именно с такими людьми вы встретите Новый год.`

let cancerhoro = `Начало года – период не то чтобы особенно сложный, но, безусловно, требующий осторожности и предусмотрительности. Старайтесь не возлагать на него слишком больших надежд, не рассчитывайте на легкие победы. Успехи в работе возможны, как и перемены к лучшему в личных отношениях, но то и другое требует от вас настойчивости, последовательных действий, обдуманных поступков. Не будет лишней помощь надежных людей. Подумайте, к кому можно за ней обратиться.
Весна принесет новые идеи и дела. Нельзя сказать, что они сразу придутся вам по душе. Скорее всего, несколько недель пройдет в сомнениях. Главное – не стараться во что бы то ни стало сохранить то, что давно устарело, утратило актуальность. Менять свои привычки, отказываться от того, что кажется естественным, непросто, но если вы справитесь с этим сейчас, то вскоре заметите перемены к лучшему во всех сферах жизни.
Лето будет благоприятным. Оно приносит ответы на многие вопросы, в том числе такие, которые уже не один год ставили вас в тупик. Становится совершенно ясно, на что стоит тратить силы, а на что – нет. Некоторых Раков ждут приятные знакомства, встречи, с которых начнутся большие перемены в жизни. Это подходящее время для того, чтобы проявлять инициативу в личных отношениях.
С сентября начинается спокойный и плодотворный период, которые продлится до конца года. Многое встает на места, становится ясным то, о чем вы прежде имели лишь приблизительное представление. Возможны удивительные совпадения. Чем ближе конец года, тем больше у вас появляется планов, на реализации которых захочется сосредоточиться в ближайшее время.`

let leohoro = `Год может начаться довольно непросто, особенно для Львов, которые рассчитывали достичь важных целей, почти не прикладывая для этого усилий. Многие дела оказываются сложнее, чем вы думали раньше, и справляться с ними нужно самостоятельно, вряд ли кто-то вам поможет. Часто оказывается полезным опыт, полученный раньше. Проще будет Львам, которые готовы признать свои ошибки и учиться на них.
Март проходит спокойно и многое расставляет по местам. Восстанавливается справедливость. Люди, которые обидели вас или причинили вам боль, стараются загладить свою вину. Может заметно улучшиться финансовая ситуация. Вам вернут старые долги, заплатят за работу, проделанную давным-давно. Некоторые Львы заключат выгодные сделки.
События апреля и мая помогут многим Львам по-новому взглянуть на привычные вещи, увидеть то, на что представители знака прежде не обращали внимания. Это благоприятное время для учебы и работы. Вам пригодятся знания, полученные давным-давно. Не исключено, что найдется применение тем вашим талантам, которые прежде окружающие считали совершенно бесполезными.
Лето будет удачным и щедрым на позитивные эмоции. Это легкий и вдохновляющий период, который приносит много приятных событий. Перемены к лучшему возможны и в деловой сфере, и в личных отношениях. Прислушивайтесь к интуиции, она неизменно подсказывает вам, как лучше действовать.
Сентябрь проходит относительно спокойно, а позже начинается период, приносящий новые дела и задачи. Вам предстоит много трудиться, решать не только свои, но и чужие проблемы. Вряд ли кто-то мог бы справиться с этим лучше вас. Сколько бы дел и забот ни было, к концу года вы подойдете в отличной форме и в хорошем настроении.`

let virgohoro = `Первые месяцы года будут неровными и беспокойными. Даже если у вас есть какие-то определенные планы, до марта едва ли удастся сосредоточиться на их реализации. То обстоятельства складываются неудачно, то союзники подводят, то приходится помогать близким, оказавшимся в сложном положении.
Но с началом весны все меняется, в жизни воцаряется порядок, которого прежде так не хватало. Становится ясно, за что нужно взяться в первую очередь, а что может подождать. Будет шанс восстановить давние деловые связи. У некоторых Дев появятся влиятельные союзники, благодаря поддержке которых представители знака смогут взяться за какие-то новые перспективные проекты или добиться успеха в деле, прежде казавшимся безнадежным. До конца мая вы наверстаете то, что считали упущенным, добьетесь успеха там, где не рассчитывали на него.
Лето будет благополучным и приятным. Это хорошее время для общения с близкими, укрепления семейных связей. К тому же у вас будет возможность разобраться в себе, определиться со своими планами, целями и приоритетами. Летние месяцы хорошо подходят для отдыха в компании членов семьи или друзей. Появляется много общих увлечений и интересов. Это очень сближает, разногласия остаются в прошлом.
Осень приносит хлопоты. Сначала их будет немного, а потом станет ясно: нужно менять привычный график, иначе никак не успеть все, что нужно. За октябрь и ноябрь вы войдете в новый ритм, а в декабре обнаружите, что у вас достаточно свободного времени и для выбора подарков близким, и для организации праздника, который порадует всех.`

let librahoro =`Вряд ли какие-то важные победы удастся одержать уже в январе. Скорее всего, начало года пройдет в суете, мелких делах, каждое из которых требует внимания. Едва ли удастся сосредоточиться на самых важных, глобальных целях. Многие Весы к тому же будут заняты решением чужих проблем – отчасти по собственному желанию, отчасти потому, что больше некому взять этот груз на себя.
Февраль и март будут интересными и яркими. Эти месяцы благоприятны для общения. Вы знакомитесь с очень разными людьми, и часто находите общий язык с теми, кто совсем на вас не похож. Вашими союзниками и друзьями становятся те, с кем прежде не удавалось поладить. Будет шанс обзавестись полезными деловыми связями. Не исключено, что перед вами откроются новые профессиональные горизонты.
С начала апреля до середины июля вы успеете сделать много полезного. Работа спорится, никакие дела не кажутся слишком сложными. Даже если вы не стремитесь сделать карьеру, в это время вполне возможно повышение, получение новых обязанностей, за которым последует и рост доходов. Вероятно решение каких-то домашних проблем. Вы найдете способ сделать и свою жизнь, и жизнь близких, комфортнее и приятнее.
Позже наступит время размышлений. Вы проанализируете события начала года, поймете, в чем были правы и где ошибались. Многое можно исправить, и если вы поторопитесь, то сделаете это до конца октября. Стоит прислушаться к советам, особенно если их дают люди, которых вы хорошо знаете.
В ноябре и декабре может быть непросто сохранять спокойствие. Помните, что неясная тревога – плохой советчик. Если вы не станете поддаваться эмоциям, то не допустите ошибок, о которых пришлось бы пожалеть.`

let scorpiohoro =`Вряд ли легко будет осуществить все, что вы запланировали на январь. Могут неожиданно возникать преграды на пути, неудачно складываться обстоятельства. Отказываться от всех идей совсем необязательно, но стоит подумать о том, на чем нужно сосредоточиться в первую очередь, а к чему можно вернуться позже. Подумайте, кто мог бы вам помочь. Не исключено, что вашими надежными союзниками станут люди, от которых вы прежде не ожидали ничего подобного.
Февраль открывает новые надежды и дает полезные подсказки. Старайтесь обращать внимание даже на незначительные события, происходящие в этом месяце. То, что сейчас кажется пустяком, может позже сыграть важную роль или натолкнуть вас на какие-то интересные мысли. Новые горизонты откроются перед Скорпионами, которые в это время решат сосредоточиться на учебе, повышении квалификации.
С начала марта до середины июля вы будете наводить порядок в своей жизни. Поверьте, это очень захватывающее занятие. Можно избавиться от ненужного, удалить преграды, избавиться от того, что мешает двигаться вперед. Расширяется круг общения, у вас появляются новые друзья, совсем не похожие на старых. В это же время что-то может измениться в личной жизни. Многие Скорпионы разберутся в своих чувствах, поймут, чего хотят на самом деле.
Период с середины лета до середины осени будет весьма беспокойным. С одной стороны, появляется много интересных дел, работы, требующей внимания, задач, которые никто, кроме вас, не может решить. С другой стороны, никак не удается определиться с планами на будущее, и это вас беспокоит. Порой кажется, что вы утратили почву под ногами. К счастью, такие периоды не продолжаются долго, к вам возвращается уверенность.
Последние месяцы года полны идей и планов, неожиданных открытий, а порой и настоящих озарений. Некоторым Скорпионам захочется кардинально изменить жизнь, и они успеют сделать это до конца года.`

let sagittariushoro =`В начале года многие сложные вопросы решаются исключительно удачно. Вы понимаете, как справиться с проблемами, которые несколько месяцев беспокоили не только вас, но и окружающих. Возможны предложения о работе о сотрудничестве. Не исключено, что вы сможете заняться именно тем делом, которое давно вызывало интерес. Дел много, но времени вам хватает на все, в том числе и на общение с друзьями, новые знакомства, романтические свидания, которые запомнятся надолго.
Март может оказаться непростым, особенно с точки зрения работы и учебы. Это время, когда вам нужно сосредоточиться, собраться с мыслями, отбросить лишнее. Не всегда это дается легко, но вы отлично справляетесь. Апрель будет совсем другим: легким и вдохновляющим, щедрым на новые возможности, а еще – дающим шанс исполнить давнее желание близкого человека. Легко изменить свою жизнь к лучшему, и вы этим пользуетесь.
Май и июнь едва ли преподнесут какие-то сюрпризы. Забот и задач может быть больше, чем вы ожидали, но непреодолимых преград на пути не возникнет, вы со всем справитесь. Помните: не обязательно заниматься всем в одиночку. Рядом есть люди, на которых можно положиться, так почему бы не воспользоваться их помощью. Станет ясно, как изменить к лучшему отношения с коллегами, завоевать их доверие и уважение.
Обратите внимание на июль и август. Эти месяцы во многом определяют, как будут развиваться события до конца года, а то и дальше. Не спешите с решениями, старайтесь не действовать под влиянием эмоций. Если в это время вы поведете себя правильно, то удача будет сопутствовать многим вашим начинаниям.
Конец года проходит спокойно и, в общем-то, не приносит ни важных событий, ни поводов для волнений. Можно плыть по течению, радоваться тем успехам, которых удается достичь, почти не прикладывая для этого усилий.`

let capricornhoro = `Год начинается исключительно удачно для представителей знака, которые готовы принимать решения и брать на себя ответственность. Лучше не затягивать январские каникулы и скорее приниматься за дела. Если вы поторопитесь, то сможете опередить конкурентов, оставить далеко позади даже очень сильных соперников. Январь и февраль дают шанс заручиться поддержкой очень влиятельных людей. Рассказывайте о своих идеях, делитесь планами. Наверняка найдутся люди, которые захотят помочь вам в осуществлении задуманного.
Март и апрель – время, когда нужно особенно внимательно прислушиваться к интуиции. На многие вещи, прежде казавшиеся привычными, вы начинаете смотреть совершенно по-другому. Возможны неожиданные предложения, связанные с большими переменами в вашей жизни. Помните, что любые важные решения нужно принимать самостоятельно. Советы крайне редко бывают действительно полезными, а вот сбить с толку и запутать могут.
Период с мая по сентябрь будет посвящен какой-то интересной работе. Если вы стремитесь к карьерному росту, не упустите шанс показать, на что вы способны. Пусть все знают, что вы способны предложить что-то новое, объединить и вдохновить единомышленников, сделать что-то полезное и необычное.
С октября начинается благоприятный период, который продлится до конца года. Он дает шанс спокойно, без лишней суеты, разобраться с накопившимися проблемами, решить проблемы, возникшие раньше. Интуиция помогает правильно расставить приоритеты. Вы не тратите время на пустяки, занимаетесь только тем, что действительно важно. Заметно меняются к лучшему отношения с окружающими. Можно восстановить старые связи, помириться с теми, с кем вы были в ссоре. Часто о вас вспоминают люди, которым вы когда-то оказали важные услуги, стараются отблагодарить и помочь в каком-то серьезном деле.`

let aquariushoro =`Не стоит возлагать больших надежд на идеи, которые появляются в начале года. Честно говоря, это время в большей степени связано с иллюзиями, чем с какими-то реальными возможностями. Лучше ничего кардинально не менять в жизни, не ставить на карту слишком многое. Позже вы не раз поблагодарите себя за то, что были осторожны и не стали рисковать.
В феврале у вас появятся новые цели и интересы. Это не самое простое время, ведь вам предстоит решать, на чем сосредоточиться, а что отбросить. Не хочется мириться с тем, что не все планы осуществимы, но не стоит тратить слишком много сил на бессмысленную борьбу с обстоятельствами. 
С марта начинается яркий благоприятный период. Он дает шанс многое изменить в жизни, исправить старые ошибки, укрепить свои позиции. Многие Водолеи обращаются к чужому опыту, и правильно делают. Именно так проще всего избежать досадных промахов, обойти ловушки, в которые пытаются заманить вас недоброжелатели. Более прочными и глубокими становятся отношения с близкими, сейчас вы по-настоящему хорошо понимаете друг друга.
С июля по сентябрь продолжается период, когда можно принимать любые важные решения, руководствуясь исключительно подсказками интуиции. Вам удается разобраться в непростых ситуациях, исправить какие-то старые ошибки, добиться больших перемен к лучшему. Многие Водолеи ставят на первое место чужие интересы, заботятся о благополучии близких. Самим представителям знака это тоже идет на пользу. 
Последние месяцы года очень хороши. Особенно благосклонны звезды к тем, кто готов сосредоточиться на сугубо практических делах. Можно добиться заметного увеличение доходов, сделать удачные покупки, вложить деньги в какой-то перспективный прибыльный проект. Многие Водолеи за декабрь научатся тому, что позже начнет приносить им прибыль.`

let pisceshoro =`В начале года многие Рыбы склонны тревожиться по пустякам. Постарайтесь сохранить спокойствие: лишние волнения вам в январе совсем ни к чему. Сосредоточьтесь на том, что у вас получается хорошо. Пусть это будут самые простые дела – даже скромные успехи радуют и вдохновляют.
Начало весны проходит в размышлениях. Вы изучаете ситуацию, стараетесь найти возможности, на которые прежде не обращали внимания. Что-то может измениться просто потому, что вы увидите привычные вещи в ином свете, узнаете то, о чем прежде даже не догадывались. Стоит быть осторожнее в общении. К сожалению, окружающие чаще сбивают вас в толку, чем помогают в чем-то.
В мае и июне вам предстоит много работать. На ваши плечи ложится ответственность за других, приходится исправлять чужие ошибки, завершать то, что было неудачно начато другими. Хотя трудностей избежать не удается, вы сохраняете хорошее настроение и оптимизм, верите – и правильно делаете! – в свой успех. Ваш оптимизм нравится окружающим, они часто предлагают поддержку.
Конец лето и начало осени будут благоприятными. Это время спокойствия. Да, дел по-прежнему много, но вы знаете, как со всем справиться, действуете проверенными методами, не допускаете ошибок. Люди, отношения с которыми прежде складывались напряженно, охотно идут на контакт. Те, кто когда-то вас обидел, стараются загладить вину. Сейчас вы можете сами выбирать союзников, решать, с кем будете дружить, а от кого будете держаться на вежливой дистанции.
Последние месяцы года хоть и беспокойны, но тоже по-своему хороши. Самое главное в это время – помнить, что не всегда успех приходит сразу, а награде порой нужно время, чтобы найти своего героя. Многое из того, что делается сейчас, обязательно пригодится в будущем. Так что не стоит грустить, если вы закончите год, не доделав какие-то дела, не решив все вопросы, которые планировали. Все обязательно получится позже!`

aries.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = arieshoro;
})
aries.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

taurus.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = taurushoro;
})
taurus.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

gemini.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = geminihoro;
})
gemini.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

cancer.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = cancerhoro;
})
cancer.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

leo.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = leohoro;
})
leo.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

virgo.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = virgohoro;
})
virgo.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

libra.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = librahoro;
})
libra.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

scorpio.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = scorpiohoro;
})
scorpio.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

sagittarius.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = sagittariushoro;
})
sagittarius.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

capricorn.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = capricornhoro;
})
capricorn.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

aquarius.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = aquariushoro;
})
aquarius.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})

pisces.addEventListener("click", ()=> {
    par.style.display = "block";
    par.textContent = pisceshoro;
})
pisces.addEventListener("dblclick", ()=> {
    par.style.display = "none";
})